# Math Operations

## Table of Contents
- [Math Operations](#math-operations)
  - [Table of Contents](#table-of-contents)
  - [Minimum](#minimum)
  - [Maximum](#maximum)
  - [Power](#power)
  - [Square Root](#square-root)
  - [Sine](#sine)
  - [Cosine](#cosine)
  - [Tangent](#tangent)
  - [Absolute Value](#absolute-value)
  - [Floor](#floor)
  - [Ceiling](#ceiling)

## Minimum
Minimum is done using the 'min' keyword. The syntax is as follows:
```lisp
(min num1 num2 num3 ... numN)
```

## Example:
```lisp
(min 1 2 3 4 5)
```
Output:
```
(min 1 2 3 4 5): 1
```

## Maximum
Maximum is done using the 'max' keyword. The syntax is as follows:
```lisp
(max num1 num2 num3 ... numN)
```

## Example:
```lisp
(max 1 2 3 4 5)
```
Output:
```
(max 1 2 3 4 5): 5
```

## Power
Power is done using the 'pow' keyword. The syntax is as follows:
```lisp
(pow num1 num2)
```

## Example:
```lisp
(pow 2 3)
```
Output:
```
(pow 2 3): 8
```

## Square Root
Square Root is done using the 'sqrt' keyword. The syntax is as follows:
```lisp
(sqrt num)
```

## Example:
```lisp
(sqrt 9)
```
Output:
```
(sqrt 9): 3
```

## Sine
Sine is done using the 'sin' keyword. The syntax is as follows:
```lisp
(sin num)
```

## Example:
```lisp
(sin 0)
```
Output:
```
(sin 0): 0
```

## Cosine
Cosine is done using the 'cos' keyword. The syntax is as follows:
```lisp
(cos num)
```

## Example:
```lisp
(cos 0)
```
Output:
```
(cos 0): 1
```

## Tangent
Tangent is done using the 'tan' keyword. The syntax is as follows:
```lisp
(tan num)
```

## Example:
```lisp
(tan 0)
```
Output:
```
(tan 0): 0
```

## Absolute Value
Absolute Value is done using the 'abs' keyword. The syntax is as follows:
```lisp
(abs num)
```

## Example:
```lisp
(abs -5)
```
Output:
```
(abs -5): 5
```

## Floor
Floor is done using the 'floor' keyword. The syntax is as follows:
```lisp
(floor num)
```

## Example:
```lisp
(floor 5.5)
```
Output:
```
(floor 5.5): 5
```

## Ceiling
Ceiling is done using the 'ceil' keyword. The syntax is as follows:
```lisp
(ceil num)
```

## Example:
```lisp
(ceil 5.5)
```
Output:
```
(ceil 5.5): 6
```